# Задача 1: Функция. Простое число.
## Условие задачи:
Дан код, который для введённого целого положительного числа, определяет является ли оно простым и, если это так, выводит YES, иначе NO:

```cpp
#include <iostream>

// Ваш код будет вставлен сюда

int main(){
    int number;
    std::cin >> number;
    std::cout << (is_prime(number) ? "YES" : "NO") << std::endl;
}
```
Этот код будет прогоняться по тестам. Ваша задача реализовать функцию is_prime таким образом, чтобы этот код стал рабочим.
### Формат ввода
Одно целое число 
2 ≤ n ≤ 2 * 10⁹.
### Формат вывода
YES, если число простое и NO, если нет.
## Решение:
```cpp
#include <iostream>
#include <cmath>
using namespace std;

int is_prime(int number) {
    if ((number == 1) || (number == 2)) {
        return true;
    }
    if (number % 2 == 0) {
        return false;
    }
    for (int i = 3; i <= sqrt(number); i += 2) {
        if (number % i == 0) {
            return false;
        }
    }
    return true;
}
```
## Пояснение решения:
Библеотеки:
 - \<iostream\> - Нужно для ввода/вывода.
 - \<cmath\> - Содержит математические функции:
sqrt(x) — квадратный корень числа x.
pow(base, exp) — возведение base в степень exp.
В коде используется для sqrt(number) в цикле проверки простоты.

1. Проверка крайних случаев:
```cpp
if ((number == 1) || (number == 2)) {
        return true;
}
```
Пояснение:
 - Если число 1 или 2 — функция возвращает true.
2. Проверка четности:
```cpp
if (number % 2 == 0) {
        return false;
}
```
Пояснение:
 - Если число делится на 2 без остатка → оно составное → возвращаем false.
3. Цикл проверки делителей:
```cpp
for (int i = 3; i <= sqrt(number); i += 2) {
    if (number % i == 0) {
        return false;
    }
}
```
Пояснение:
 - Проверяем делители от 3 до √number с шагом 2 (только нечётные).
 - Если находим делитель: return false.
4. Если делителей нет:
```cpp
return true;
```
Пояснение:
 - Число простое → возвращаем true.