# Задача 4: Функция. Сортировка по количеству единиц.
## Условие задачи:
Дан код, который получает последовательность целых положительных чисел, состоящих из единиц и нулей (без ведущих нулей) и сортирует её по убыванию количества единиц в числе. Числа, с одинаковым количеством единиц, должны быть отсортированы по возрастанию значения:

```cpp
#include <iostream>
#include <algorithm>
#include <vector>
#include <string>

// Ваш код будет вставлен сюда

int main(){
    int count;
    std::cin >> count;
    
    std::vector<std::string> nums(count);
    for(auto& line : nums) std::cin >> line;
    
    std::sort(nums.begin(), nums.end(), compare);
    
    for(auto& line : nums) std::cout << line << ' ';
}
```
Этот код будет прогоняться по тестам. Ваша задача реализовать функцию compare таким образом, чтобы код стал рабочим.
### Формат ввода
В первой строке входных данных указано количество чисел в последовательности 1 ≤ n ≤ 1000.

Во второй строке входных данных указано n чисел состоящих только из нулей и единиц  1 ≤ aᵢ ≤ 1111111111. Числа разделены пробелами.
### Формат вывода
Отсортированная последовательность чисел, через пробел.
## Решение:
```cpp
#include <iostream>
#include <algorithm>
#include <vector>
#include <string>
using namespace std;

bool compare(const string& num1, const string& num2) {
    int count1 = count(num1.begin(), num1.end(), '1');
    int count2 = count(num2.begin(), num2.end(), '1');
    if (count1 != count2) {
        return count1 > count2;
    }
    if (num1.size() != num2.size()) {
        return num1.size() < num2.size();
    } 
    return num1 < num2;
}
```
## Пояснение решения:
Библеотеки:
 - \<iostream\> - Нужно для ввода/вывода.
 - \<string\> — для работы со строками.
 - \<algorithm\> - для функции sort() и count()
 - \<vector\> - для динамического массива vector
1. Объявление функции compare:
```cpp
bool compare(const string& num1, const string& num2)
```
Пояснение:
 - Это функция-компаратор, которую использует sort() для сравнения двух элементов.
 - Принимает две строки num1 и num2 (каждая — это двоичное число, например "101" или "1110").
 - Возвращает true, если num1 должно стоять перед num2 в отсортированном порядке.
2. Подсчёт количества единиц:
```cpp
int count1 = count(num1.begin(), num1.end(), '1');
int count2 = count(num2.begin(), num2.end(), '1');
```
Пояснение:
 - count() проходит по строке и считает, сколько раз встречается символ '1'.
 - Так получаем количество единиц в каждом числе.
3. Сравнение по количеству единиц:
```cpp
if (count1 != count2) {
    return count1 > count2;
}
```
Пояснение:
 - Если количество единиц разное — число с большим количеством единиц идёт первым.
 - То есть сортировка по убыванию количества единиц.
4. Если единиц одинаково — сравниваем по длине:
```cpp
if (num1.size() != num2.size()) {
    return num1.size() < num2.size();
}
```
Пояснение:
 - Если количество единиц одинаковое, то сравниваем длину строк.
 - Меньшая длина означает меньшее число (ведущих нулей нет, так что строковое сравнение длины корректно).
5. Если длина одинаковая — сравнение по значению:
```cpp
return num1 < num2;
```
Пояснение:
 - Если длина и количество единиц одинаковые, то просто сравниваем строки как числа.
 - В строковом виде это равносильно сравнению по возрастанию, т.к. без ведущих нулей порядок совпадает с числовым.