# Задача 1: Объединить отсортированные последовательности.
## Условие задачи:
Даны две отсортированные по неубыванию последовательности целых чисел. Объедините их в одну последовательность отсортированную по неубыванию.
### Формат ввода
В первой строке указано число 1 ≤ n ≤ 1000000 - количество чисел в первой последовательности. В следующей строке перечислены элементы последовательности 10⁻⁹ ≤ aᵢ ≤ 10⁹ через пробел.
В третьей строке указано число 1 ≤ m ≤ 1000000 - количество чисел во второй последовательности. В следующей строке перечислены элементы последовательности 10⁻⁹ ≤ bᵢ ≤ 10⁹ через пробел.
### Формат вывода
Последовательность чисел длиной n + m элементы которой разделены пробелом.
## Решение:
```cpp
#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

int main() {
    int n1, n2;
    cin >> n1;
    vector<int> nums1(n1);
    for (int i = 0; i < n1; i++) {
        cin >> nums1[i];
    }
    cin >> n2;
    vector<int> nums2(n2);
    for (int i = 0; i < n2; i++) {
        cin >> nums2[i];
    }
    for (int i = 0; i < n2; i++) {
        nums1.push_back(nums2[i]);
    }
    sort(nums1.begin(), nums1.end());
    for (int x : nums1) {
        cout << x << " ";
    }
}
```
## Пояснение решения:
Библеотеки:
 - \<iostream\> — для ввода и вывода (cin, cout).
 - \<vector\> — чтобы использовать динамические массивы (vector<int>).
 - \<algorithm\> — содержит функцию sort, которая нужна для сортировки.

1. Чтение первой последовательности:
```cpp
int n1, n2;
cin >> n1;
vector<int> nums1(n1);
for (int i = 0; i < n1; i++) {
    cin >> nums1[i];
}
```
Пояснение:
 - Считывается n1 — длина первой последовательности.
 - Создаётся vector<int> nums1 длиной n1.
 - В цикле считываются n1 чисел в nums1.
2. Чтение второй последовательности:
```cpp
cin >> n2;
vector<int> nums2(n2);
for (int i = 0; i < n2; i++) {
    cin >> nums2[i];
}
```
Пояснение:
 - Считывает длину второй последовательности n2.
 - Создаёт nums2 длиной n2.
 - Считывает n2 элементов в неё.
3. Объединение последовательностей:
```cpp
for (int i = 0; i < n2; i++) {
    nums1.push_back(nums2[i]);
}
```
Пояснение:
 - К первой последовательности nums1 добавляются все элементы второй (nums2).
 - После этого nums1 содержит все числа обеих последовательностей.
4. Сортировка объединённого массива и вывод результата:
```cpp
sort(nums1.begin(), nums1.end());
for (int x : nums1) {
    cout << x << " ";
}
```
Пояснение:
 - Сортирует nums1 по возрастанию (неубыванию).
 - Проходит по каждому элементу nums1 и выводит через пробел.