# Задача 5: Самое частое слово.
## Условие задачи:
Дан довольно большой текст состоящий из слов разделённых пробелами. Определите, какое слово в этом тексте встречается чаще остальных. Если таких слов несколько выведите их все в лексикографическом порядке.
### Формат ввода
Число слов в тексте 1 ≤ n ≤ 10000 затем, с новой строки перечислены слова разделённые пробелами. Слова состоят из строчных латинских символов \[a-z]. Размер слова 5 символов.
### Формат вывода
Слово или список слов отсортированных в лексикографическом порядке и разделённых пробелом.
## Решение:
```cpp
#include <iostream>
#include <vector>
#include <sstream>
#include <string>
#include <map>
#include <climits>
using namespace std;

int main() {
    int n;
    string str, word;
    vector<string> words;
    map<string, int> count;

    cin >> n; 
	cin.ignore();
    getline(cin, str);
    istringstream ss(str);

    while (ss >> word) {
        words.push_back(word);
    }
    for (string w : words) {
        count[w] += 1;
    }
    int maxVal = INT_MIN;
    for (auto &p : count) {
        if (p.second > maxVal) {
            maxVal = p.second;
        }
    }
    for (auto &g : count) {
        if (g.second == maxVal) {
            cout << g.first << " ";
        }
    }

}
```
## Пояснение решения:
Библеотеки:
 - \<iostream\> — для ввода и вывода (cin, cout).
 - \<vector\> — хранение результата с использованием динамических массивов (vector<string>).
 - \<string\> — работа со строками.
 - \<sstream\> – разбор строки на слова (istringstream).
 - \<map\> — хранит пары (слово → количество повторений);
 - \<climits\> — содержит INT_MIN, минимальное значение int, чтобы можно было искать максимум.

1. Считывание входных данных:
```cpp
cin >> n; 
cin.ignore();
getline(cin, str);
```
Пояснение:
 - n — количество слов в тексте;
 - cin.ignore() — убирает символ \n после числа;
 - getline(cin, str) — считывает всю строку текста целиком (все слова через пробел).
2. Разделение строки на отдельные слова:
```cpp
istringstream ss(str);
while (ss >> word) {
    words.push_back(word);
}
```
Пояснение:
 - Создаём поток ss из строки str.
 - Читаем из него слова по одному и добавляем в вектор words.
3. Подсчёт количества каждого слова:
```cpp
for (string w : words) {
    count[w] += 1;
}
```
Пояснение:
 - В map<string, int> каждое слово хранится как ключ.
 - При встрече слова счётчик увеличивается.
4.  Поиск максимального количества повторений:
```cpp
int maxVal = INT_MIN;
for (auto &p : count) {
    if (p.second > maxVal) {
        maxVal = p.second;
    }
}
```
Пояснение:
 - Проходим по всем словам и ищем, у какого слова счётчик (p.second) больше всего.
 - В конце maxVal — это количество повторений самого частого слова.
5. Вывод самых частых слов:
```cpp
for (auto &g : count) {
    if (g.second == maxVal) {
        cout << g.first << " ";
    }
}
```
Пояснение:
 - Если несколько слов встречаются одинаково часто, выводятся все — в алфавитном порядке (потому что map по ключу (string) сам хранит пары отсортированными).